Revit 2024 API
TableSectionData.GetCustomFieldId Method
 Gets custom field id from the cell.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public Guid GetCustomFieldId(
	int row,
	int col
)
Visual Basic
Public Function GetCustomFieldId ( _
	row As Integer, _
	col As Integer _
) As Guid
Visual C++
public:
Guid GetCustomFieldId(
	int row,
	int col
)
Parameters
row
Type: System.Int32
 The row of the cell.
col
Type: System.Int32
 The column of the cell.
Return Value
 Returns custom field id from the cell. If this cell is not of type CellType.CustomField it will return an empty Guid
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The given row number row is invalid. -or- The given column number col is invalid.
See Also
TableSectionData Class
Autodesk.Revit.DB Namespace